In [1]:
!pip install psycopg2 sqlalchemy

Requirement already satisfied: psycopg2 in c:\users\audelia\anaconda3\lib\site-packages (2.8.4)
Requirement already satisfied: sqlalchemy in c:\users\audelia\anaconda3\lib\site-packages (1.3.9)

In [2]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [3]:
from sqlalchemy import create_engine
engine = create_engine('postgres://postgres:postgres@localhost:5432/sql_homework')
conn = engine.connect()

In [4]:
salaries = pd.read_sql("SELECT * FROM salaries", conn)
salaries.head()

   emp_no salary   from_date     to_date
0   10001  60117  1986-06-26  1987-06-26
1   10002  65828  1996-08-03  1997-08-03
2   10003  40006  1995-12-03  1996-12-02
3   10004  40054  1986-12-01  1987-12-01
4   10005  78228  1989-09-12  1990-09-12

In [5]:
titles = pd.read_sql("SELECT * FROM titles", conn)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [6]:
sal_title = pd.merge(salaries, titles)
sal_title.head()

   emp_no salary   from_date     to_date         title
0   10015  40000  1992-09-19  1993-08-22  Senior Staff
1   10073  56473  1998-02-02  1998-02-22      Engineer
2   10082  48935  1990-01-03  1990-01-15         Staff
3   10131  48475  1999-09-17  1999-12-06      Engineer
4   10186  40000  1996-12-25  1997-08-16         Staff

In [7]:
sal_title=sal_title.drop(columns = "emp_no")
sal_title.head()

  salary   from_date     to_date         title
0  40000  1992-09-19  1993-08-22  Senior Staff
1  56473  1998-02-02  1998-02-22      Engineer
2  48935  1990-01-03  1990-01-15         Staff
3  48475  1999-09-17  1999-12-06      Engineer
4  40000  1996-12-25  1997-08-16         Staff

In [8]:
sal_title=sal_title.drop(columns = "from_date")
sal_title.head()

  salary     to_date         title
0  40000  1993-08-22  Senior Staff
1  56473  1998-02-22      Engineer
2  48935  1990-01-15         Staff
3  48475  1999-12-06      Engineer
4  40000  1997-08-16         Staff

In [9]:
sal_title=sal_title.drop(columns = "to_date")
sal_title.head()

  salary         title
0  40000  Senior Staff
1  56473      Engineer
2  48935         Staff
3  48475      Engineer
4  40000         Staff

In [13]:
new_df=sal_title.groupby("salary").mean()
new_df.head()

DataError: No numeric types to aggregate